luc-github/ESP3D/esp8266/webinterface.cpp
											}
										
										pos_tag=sLine.indexOf("$AVAILABLE_AP[");
										if (pos_tag!=-1) //if yes
											{  //extract line
												int pos_tag_end = sLine.indexOf("]$",pos_tag);
												int nb = -1;
												int ipos = -1;
												//part before repetitive section
												String beforelinetoprocess=sLine.substring( 0,pos_tag);
												//part after repetitive section
												String afterlinetoprocess=sLine.substring( pos_tag_end+2);
												//repetitive section itself
												String linetoprocess =sLine.substring( pos_tag+strlen("$AVAILABLE_AP["),pos_tag_end);
												String tablepart;
												//get how many items
												ipos=KeysList.get_index("$AVAILABLE_AP_NB_ITEMS$");
												if (ipos >-1)
													{   //get value
														nb=atoi(ValuesList.get(ipos));
														ipos=ipos-(nb*4);
													}
												//do a sanity check data are there
												String Last_IP_Key = "$IS_PROTECTED["+String(nb-1)+"]$";
												if (nb>0 && (KeysList.get_index("$ROW_NUMBER[0]$")==ipos) &&(Last_IP_Key==KeysList.get(ipos-1+(nb*4))))
													{
													for (int j=0;j<nb;j++)
														{
															String tmppart=linetoprocess + "\n";
															if (ipos+j>-1)
																{
																	tmppart.replace("$ROW_NUMBER$",ValuesList.get(ipos+0+(j*4)));
																	tmppart.replace("$AP_SSID$",ValuesList.get(ipos+1+(j*4)));
																	tmppart.replace("$AP_SIGNAL$",ValuesList.get(ipos+2+(j*4)));
																	tmppart.replace("$IS_PROTECTED$",ValuesList.get(ipos+3+(j*4)));
																}
															tablepart +=tmppart;
														}
													}
												//now build back
												sLine = beforelinetoprocess + tablepart + afterlinetoprocess;
												
											}
										
										//add current line to buffer
										buffer2send+=sLine;
										//if buffer limit is reached
										if (buffer2send.length()>1200)
										{  //if we are just doing size calculation
											if (processing_step==0)
											{  //add buffer size
												size_content+=buffer2send.length();
											}
											else //if no size calculation, send data
											{ //if header is not send yet 
											if (!header_sent)
												{//send header with calculated size
												header_sent=true;
												 web_interface->WebServer.sendContent(bufferheader);
												}
											//send data
											 web_interface->WebServer.sendContent(buffer2send);
											}
											//reset buffer
											buffer2send="";
										}
									}
								 //reset line
								sLine="";
								//add a delay for safety for WDT
								delay(1);
							}
					}
				else //EOF is reached
					{   //close current file
						currentfile.close();
						//if current file is not template file but incled one
						if (myFileList.size()>0)
							{  //get level +1 file description and continue
								currentfile = myFileList.pop();
							}
						else
							{//we have done template parsing, let's stop reading
							bprocessing=false;
							}
					}
				}
			}
		//check if something is still in buffer and need to be send
		if (buffer2send!=""){
			//if we are doing size calculation
			if (processing_step==0)
				{  //add buffer size
					size_content+=buffer2send.length();
				}
			else //if no size calculation, send data
				{ //if header is not send yet 
				  if (!header_sent)
						{//send header with calculated size
						 web_interface->WebServer.sendContent(bufferheader);
						}
				  //send data
				   web_interface->WebServer.sendContent(buffer2send);
				}
		  }
    //if we end size calculation loop
	if (processing_step==0)
		{  //let's build the header with correct size'
			bufferheader = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\nContent-Length: "+String(size_content)+"\r\nConnection: close\r\nAccess-Control-Allow-Origin: *\r\n\r\n";
		}
	}
	return true;
}

//root insterface
void handle_web_interface_root()
{
	String stmp;
	long lstatus;
	int istatus;
	byte bbuf;
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
	struct softap_config apconfig;
	struct ip_info info;
	uint8_t mac [WL_MAC_ADDR_LENGTH];
	//Free Mem, put at the end to reflect situation
	KeysList.add(FPSTR(KEY_FREE_MEM));
	ValuesList.add(intTostr(system_get_free_heap_size()));
	//IP
	stmp=FPSTR(KEY_IP);
	KeysList.add(stmp);
	if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
	else stmp=WiFi.softAPIP().toString();
	ValuesList.add(stmp);
	//Web address = ip + port
	KeysList.add(FPSTR(KEY_WEB_ADDRESS));
	if (wifi_config.iweb_port!=80)
		{
		stmp+=":";
		stmp+=intTostr(wifi_config.iweb_port);
		}
	ValuesList.add(stmp);
	//Hostname
	if (wifi_get_opmode()==WIFI_STA )
		{
		KeysList.add(FPSTR(KEY_MODE));
		ValuesList.add(FPSTR(VALUE_STA));
		KeysList.add(FPSTR(KEY_HOSTNAME));
		ValuesList.add(wifi_config.get_hostname());
		KeysList.add(FPSTR(KEY_HOSTNAME_VISIBLE));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		}
	else
		{
		KeysList.add(FPSTR(KEY_HOSTNAME));
		ValuesList.add(FPSTR(KEY_NOT_APPLICABLE_4_AP));
		KeysList.add(FPSTR(KEY_HOSTNAME_VISIBLE));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		if (wifi_get_opmode()==WIFI_AP )
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP));
			}
		else
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP_STA));
			}
		}
	//page title
	KeysList.add(FPSTR(KEY_PAGE_TITLE));
	ValuesList.add(FPSTR(VALUE_HOME));
	//tpl file name with extension
	KeysList.add(FPSTR(KEY_FILE_NAME));
	ValuesList.add("home.tpl");
	//tpl file name without extension
	KeysList.add(FPSTR(KEY_SHORT_FILE_NAME));
	ValuesList.add("home");
	//menu item
	KeysList.add(FPSTR(KEY_MENU_HOME));
	ValuesList.add(FPSTR(VALUE_ACTIVE));
	//FW Version
	KeysList.add(FPSTR(KEY_FW_VER));
	ValuesList.add(FPSTR(VALUE_FW_VERSION));
	//Chip ID
	KeysList.add(FPSTR(KEY_CHIP_ID));
	ValuesList.add( intTostr(system_get_chip_id()));
	//CPU Freq
	KeysList.add(FPSTR(KEY_CPU_FREQ));
	ValuesList.add(intTostr(system_get_cpu_freq()));
	//SDK Version
	KeysList.add(FPSTR(KEY_SDK_VER));
	ValuesList.add(system_get_sdk_version());
	//MDNS Feature
	#ifdef MDNS_FEATURE
	KeysList.add(FPSTR(KEY_MDNS_NAME));
	stmp="http://";
	stmp+=wifi_config.get_hostname();
	stmp+=".local";
	ValuesList.add(stmp);
	KeysList.add(FPSTR(KEY_MDNS_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
	#else
	KeysList.add(FPSTR(KEY_MDNS_NAME));
	ValuesList.add(FPSTR(VALUE_DISABLED));
	KeysList.add(FPSTR(KEY_MDNS_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
	#endif
	//SSDP Feature
	#ifdef SSDP_FEATURE
	KeysList.add(FPSTR(KEY_SSDP_STATUS));
	ValuesList.add(FPSTR(VALUE_ENABLED));
	KeysList.add(FPSTR(KEY_SSDP_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
	#else
	KeysList.add(FPSTR(KEY_SSDP_STATUS));
	ValuesList.add(FPSTR(VALUE_DISABLED));
	KeysList.add(FPSTR(KEY_SSDP_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
	#endif
	//Captive portal Feature
	#ifdef CAPTIVE_PORTAL_FEATURE
	if (wifi_get_opmode()==WIFI_AP)
		{
		KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_STATUS));
		ValuesList.add(FPSTR(VALUE_ENABLED));
		KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_VISIBLE));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		}
	else
		{
		KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_STATUS));
		ValuesList.add(FPSTR(VALUE_DISABLED));
		KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_VISIBLE));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		}
	#else
	KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_STATUS));
	ValuesList.add(FPSTR(VALUE_DISABLED));
	KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
	#endif
	//network	
	KeysList.add(FPSTR(KEY_NET_PHY));
	if (wifi_get_phy_mode()==PHY_MODE_11B) ValuesList.add(FPSTR(VALUE_11B));
	else if (wifi_get_phy_mode()==PHY_MODE_11G)ValuesList.add(FPSTR(VALUE_11G));
	else ValuesList.add(FPSTR(VALUE_11N));
	//sleep mode
	KeysList.add(FPSTR(KEY_SLEEP_MODE));
	if (wifi_get_sleep_type()==NONE_SLEEP_T) ValuesList.add(FPSTR(VALUE_NONE));
	else if (wifi_get_sleep_type()==LIGHT_SLEEP_T) ValuesList.add(FPSTR(VALUE_LIGHT));
	else  ValuesList.add(FPSTR(VALUE_MODEM));
	//Boot version
	KeysList.add(FPSTR(KEY_BOOT_VER));
	ValuesList.add(intTostr(system_get_boot_version()));
	//baud rate
	KeysList.add(FPSTR(KEY_BAUD_RATE));
	ValuesList.add(intTostr(wifi_config.baud_rate));
	//Web Port
	KeysList.add(FPSTR(KEY_WEB_PORT));
	ValuesList.add(intTostr(wifi_config.iweb_port));
	//Web Port
	KeysList.add(FPSTR(KEY_DATA_PORT));
	ValuesList.add(intTostr(wifi_config.idata_port));
	//AP part
	if (wifi_get_opmode()==WIFI_AP ||  wifi_get_opmode()==WIFI_AP_STA) 
		{
		int client_counter=0;
		struct station_info * station;
		//AP is enabled
		KeysList.add(FPSTR(KEY_AP_STATUS_ENABLED));
		ValuesList.add(FPSTR(VALUE_ENABLED));
		//set visible
		KeysList.add(FPSTR(KEY_AP_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		//list of connected clients
		station = wifi_softap_get_station_info();
		while(station)
			{
				//Row number
				 stmp = "$ROW_NUMBER["+String(client_counter)+"]$";
				KeysList.add(stmp.c_str());
				stmp=String(client_counter+1);
				ValuesList.add(stmp);
				//BSSID
				stmp = "$MAC_CONNECTED["+String(client_counter)+"]$";
				KeysList.add(stmp.c_str());
				
				ValuesList.add(wifi_config.mac2str(station->bssid));
				//IP
				stmp = "$IP_CONNECTED["+String(client_counter)+"]$";
				KeysList.add(stmp.c_str());
				ValuesList.add(wifi_config.ip2str((byte *)&station->ip));
			    //increment counter
				client_counter++;
				//go next record
				station = STAILQ_NEXT(station, next);
			}
		wifi_softap_free_station_info();
		//Connected clients
		KeysList.add(FPSTR(KEY_CONNECTED_STATIONS_NB_ITEMS));
		ValuesList.add(intTostr(client_counter));
		}
	else
		{
		//AP is disabled
		KeysList.add(FPSTR(KEY_AP_STATUS_ENABLED));
		ValuesList.add(FPSTR(VALUE_DISABLED));
		//set hide
		KeysList.add(FPSTR(KEY_AP_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		//Connected clients
		KeysList.add(FPSTR(KEY_CONNECTED_STATIONS_NB_ITEMS));
		ValuesList.add("0");
		}
	//AP mac address
	KeysList.add(FPSTR(KEY_AP_MAC));
	ValuesList.add(wifi_config.mac2str(WiFi.softAPmacAddress(mac)));
	//AP configuration
	if (wifi_softap_get_config(&apconfig))
		{
		//SSID
		KeysList.add(FPSTR(KEY_AP_SSID));
		ValuesList.add((char *)(apconfig.ssid));
		//AP visibile or hidden
		KeysList.add(FPSTR(KEY_AP_IS_VISIBLE));
		if(apconfig.ssid_hidden==1)ValuesList.add(FPSTR(VALUE_NO));
		else ValuesList.add(FPSTR(VALUE_YES));
		//Channel
		KeysList.add(FPSTR(KEY_AP_CHANNEL));
		ValuesList.add(intTostr(apconfig.channel));
		//Authentification mode
		KeysList.add(FPSTR(KEY_AP_AUTH));
		if (apconfig.authmode==AUTH_OPEN)ValuesList.add(FPSTR(VALUE_NONE));
		else if (apconfig.authmode==AUTH_WEP)ValuesList.add(FPSTR(VALUE_WEP));
		else if (apconfig.authmode==AUTH_WPA_PSK)ValuesList.add(FPSTR(VALUE_WPA));
		else if (apconfig.authmode==AUTH_WPA2_PSK)ValuesList.add(FPSTR(VALUE_WPA2));
		else if (apconfig.authmode==AUTH_WPA_WPA2_PSK)ValuesList.add(FPSTR(VALUE_WPAWPA2));
		else ValuesList.add(FPSTR(VALUE_MAX)); //what is this one ? WPS ? Cannot find information
		//Max connections
		KeysList.add(FPSTR(KEY_AP_MAX_CON));
		ValuesList.add(intTostr(apconfig.max_connection));
		}
	else
		{
		//SSID
		KeysList.add(FPSTR(KEY_AP_SSID));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		//AP visibile or hidden
		KeysList.add(FPSTR(KEY_AP_IS_VISIBLE));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		//Channel
		KeysList.add(FPSTR(KEY_AP_CHANNEL));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		//Authentification mode
		KeysList.add(FPSTR(KEY_AP_AUTH));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		//Max connections
		KeysList.add(FPSTR(KEY_AP_MAX_CON));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		}
	KeysList.add(FPSTR(KEY_AP_DHCP_STATUS));
	if (wifi_softap_dhcps_status()==DHCP_STARTED)ValuesList.add(FPSTR(VALUE_STARTED));
	else ValuesList.add(FPSTR(VALUE_STOPPED));
	//IP/GW/MASK
	if (wifi_get_ip_info(SOFTAP_IF,&info))
		{
			//IP address
			KeysList.add(FPSTR(KEY_AP_IP));
			ValuesList.add(wifi_config.ip2str(info.ip.addr));
			//GW address
			KeysList.add(FPSTR(KEY_AP_GW));
			ValuesList.add(wifi_config.ip2str(info.gw.addr));
			//Sub Net Mask
			KeysList.add(FPSTR(KEY_AP_SUBNET));
			ValuesList.add(wifi_config.ip2str(info.netmask.addr));
		}
	else
		{
			//IP address
			KeysList.add(FPSTR(KEY_AP_IP));
			ValuesList.add(FPSTR(VALUE_NO_IP));
			//GW address
			KeysList.add(FPSTR(KEY_AP_GW));
			ValuesList.add(FPSTR(VALUE_NO_IP));
			//Sub Net Mask
			KeysList.add(FPSTR(KEY_AP_SUBNET));
			ValuesList.add(FPSTR(VALUE_NO_IP));
		}
	//STA part
	if (wifi_get_opmode()==WIFI_STA ||  wifi_get_opmode()==WIFI_AP_STA) 
		{
			//STA is enabled
			KeysList.add(FPSTR(KEY_STA_STATUS_ENABLED));
			ValuesList.add(FPSTR(VALUE_ENABLED));
			//set visible
			KeysList.add(FPSTR(KEY_STA_VISIBILITY));
			ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		}
	else
		{
			//STA is disabled
			KeysList.add(FPSTR(KEY_STA_STATUS_ENABLED));
			ValuesList.add(FPSTR(VALUE_DISABLED));
			//set hide
			KeysList.add(FPSTR(KEY_STA_VISIBILITY));
			ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		}
	//STA mac address
	KeysList.add(FPSTR(KEY_STA_MAC));
	ValuesList.add(wifi_config.mac2str(WiFi.macAddress(mac)));
	//SSID used by STA
	KeysList.add(FPSTR(KEY_STA_SSID));
	if (WiFi.SSID().length()==0)ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
	else ValuesList.add(WiFi.SSID().c_str());
	//Channel
	KeysList.add(FPSTR(KEY_STA_CHANNEL));
	ValuesList.add(intTostr (wifi_get_channel()));
	//Connection status
	istatus = wifi_station_get_connect_status();
	KeysList.add(FPSTR(KEY_STA_STATUS));
	if (istatus==STATION_GOT_IP) ValuesList.add(FPSTR(VALUE_CONNECTED));
	else if  (istatus==STATION_NO_AP_FOUND) ValuesList.add(FPSTR(VALUE_NO_SSID));
	else if  (istatus==STATION_CONNECT_FAIL) ValuesList.add(FPSTR(VALUE_CONNECTION_FAILED));
	else if  (istatus==STATION_WRONG_PASSWORD) ValuesList.add(FPSTR(VALUE_CONNECTION_FAILED2));
	else if  (istatus==STATION_IDLE) ValuesList.add(FPSTR(VALUE_IDLE));//should not happen
	else ValuesList.add(FPSTR(VALUE_DISCONNECTED));
	//DHCP Client status
	KeysList.add(FPSTR(KEY_STA_DHCP_STATUS));
	if (wifi_station_dhcpc_status()==DHCP_STARTED)ValuesList.add(FPSTR(VALUE_STARTED));
	else ValuesList.add(FPSTR(VALUE_STOPPED));
	//IP address
	KeysList.add(FPSTR(KEY_STA_IP));
	ValuesList.add(WiFi.localIP().toString().c_str());
	//GW address
	KeysList.add(FPSTR(KEY_STA_GW));
	ValuesList.add(WiFi.gatewayIP().toString().c_str());
	//Sub Net Mask
	KeysList.add(FPSTR(KEY_STA_SUBNET));
	ValuesList.add(WiFi.subnetMask().toString().c_str());
    //Service page / no need refresh on this page
    KeysList.add(FPSTR(KEY_SERVICE_PAGE));
	ValuesList.add("");

	//process the template file and provide list of variables
	if(KeysList.size()==ValuesList.size())	//Sanity check
		processTemplate("/home.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}

void handle_web_interface_configSys()
{
	String stmp,smsg;
	long lstatus;
	int istatus;
	byte bbuf;
	long ibaud=DEFAULT_BAUD_RATE;
	int iweb_port =DEFAULT_WEB_PORT;
	int idata_port =DEFAULT_DATA_PORT;
	byte bsleepmode=DEFAULT_SLEEP_MODE;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
	long lbaudlist[] = {9600 ,19200,38400,57600,115200,230400,250000,-1};
	int bmodemvaluelist[] = {NONE_SLEEP_T,LIGHT_SLEEP_T,MODEM_SLEEP_T, -1};
	const __FlashStringHelper  *smodemdisplaylist[]={FPSTR(VALUE_NONE),FPSTR(VALUE_LIGHT),FPSTR(VALUE_MODEM),FPSTR(VALUE_MODEM)};
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
	//Free Mem, put at the end to reflect situation
	KeysList.add(FPSTR(KEY_FREE_MEM));
	ValuesList.add(intTostr(system_get_free_heap_size()));
	//IP
	stmp=FPSTR(KEY_IP);
	KeysList.add(stmp);
	if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
	else stmp=WiFi.softAPIP().toString();
	ValuesList.add(stmp);
	//Web address = ip + port
	KeysList.add(FPSTR(KEY_WEB_ADDRESS));
	if (wifi_config.iweb_port!=80)
		{
		stmp+=":";
		stmp+=intTostr(wifi_config.iweb_port);
		}
	ValuesList.add(stmp);
	//mode
	if (wifi_get_opmode()==WIFI_STA )
		{
		KeysList.add(FPSTR(KEY_MODE));
		ValuesList.add(FPSTR(VALUE_STA));
		}
	else
		{
		if (wifi_get_opmode()==WIFI_AP )
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP));
			}
		else
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP_STA));
			}
		}
	//FW Version
	KeysList.add(FPSTR(KEY_FW_VER));
	ValuesList.add(FPSTR(VALUE_FW_VERSION));
	//page title
	KeysList.add(FPSTR(KEY_PAGE_TITLE));
	ValuesList.add(FPSTR(VALUE_HOME));
	//tpl file name with extension
	KeysList.add(FPSTR(KEY_FILE_NAME));
	ValuesList.add("system.tpl");
	//tpl file name without extension
	KeysList.add(FPSTR(KEY_SHORT_FILE_NAME));
	ValuesList.add("system");
	//menu item
	KeysList.add(FPSTR(KEY_MENU_SYSTEM));
	ValuesList.add(FPSTR(VALUE_ACTIVE));

  //check is it is a submission or a display
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  	  if (web_interface->WebServer.hasArg("BAUD_RATE") && web_interface->WebServer.hasArg("SLEEP_MODE")&& web_interface->WebServer.hasArg("DATAPORT")&& web_interface->WebServer.hasArg("WEBPORT"))
		{   //is each value correct ?
			ibaud  = web_interface->WebServer.arg("BAUD_RATE").toInt();
			iweb_port  = web_interface->WebServer.arg("WEBPORT").toInt();
			idata_port  = web_interface->WebServer.arg("DATAPORT").toInt();
			bsleepmode = web_interface->WebServer.arg("SLEEP_MODE").toInt();

