luc-github/ESP3D/esp8266/webinterface.cpp
			if (!(iweb_port>0 && iweb_port<65001))
				{
					msg_alert_error=true;
					smsg+="Error : invalid port value for web port<BR>";
					KeysList.add(FPSTR(KEY_WEB_PORT_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			 if (!(idata_port>0 && idata_port<65001))
				{
					msg_alert_error=true;
					smsg+="Error : invalid port value for data port<BR>";
					KeysList.add(FPSTR(KEY_DATA_PORT_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			if (iweb_port== idata_port)
				{
					msg_alert_error=true;
					smsg+="Error : web port and data port cannot be identical<BR>";
					KeysList.add(FPSTR(KEY_WEB_PORT_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
					KeysList.add(FPSTR(KEY_DATA_PORT_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			if (!(ibaud==9600 || ibaud==19200|| ibaud==38400|| ibaud==57600|| ibaud==115200|| ibaud==230400 || ibaud==250000)) 
				{
					msg_alert_error=true;
					smsg+="Error : value for baud rate is not correct<BR>";
					KeysList.add(FPSTR(KEY_BAUD_RATE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			if (!(bsleepmode==NONE_SLEEP_T ||bsleepmode==LIGHT_SLEEP_T ||bsleepmode==MODEM_SLEEP_T ))
				{
					msg_alert_error=true;
					smsg+="Error : value for sleeping mode is not correct<BR>";
					KeysList.add(FPSTR(KEY_SLEEP_MODE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
	  }
	  else
	   {
		msg_alert_error=true;
		smsg="Error : Missing data";
	   }
	   //if no error apply the changes
		if (msg_alert_error!=true)
			{
			 if(!CONFIG::write_buffer(EP_BAUD_RATE,(const byte *)&ibaud,INTEGER_LENGTH)||!CONFIG::write_buffer(EP_WEB_PORT,(const byte *)&iweb_port,INTEGER_LENGTH)||!CONFIG::write_buffer(EP_DATA_PORT,(const byte *)&idata_port,INTEGER_LENGTH)||!CONFIG::write_byte(EP_SLEEP_MODE,bsleepmode))
				{
					msg_alert_error=true;
					smsg="Error : Cannot write to EEPROM";
				}
			else
				{
					msg_alert_success=true;
					wifi_config.iweb_port=iweb_port;
					wifi_config.idata_port=idata_port;
					smsg="Changes saved to EEPROM, restarting....";
				}
			}
		
  }
  else //no submit need to get data from EEPROM
	{
	if (!CONFIG::read_buffer(EP_BAUD_RATE,  (byte *)&ibaud , INTEGER_LENGTH))ibaud=DEFAULT_BAUD_RATE;
	if (!CONFIG::read_byte(EP_SLEEP_MODE, &bsleepmode ))bsleepmode=DEFAULT_SLEEP_MODE;
	if (!CONFIG::read_buffer(EP_WEB_PORT,  (byte *)&iweb_port , INTEGER_LENGTH))iweb_port=DEFAULT_WEB_PORT;
	if (!CONFIG::read_buffer(EP_DATA_PORT,  (byte *)&idata_port , INTEGER_LENGTH))idata_port=DEFAULT_DATA_PORT;
	}
	//Baud rate list
	istatus = 0;
	stmp="";
	while (lbaudlist[istatus]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(lbaudlist[istatus]);
		stmp+="\" ";
		if (lbaudlist[istatus]==ibaud)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=intTostr(lbaudlist[istatus]);
		stmp+= "</OPTION>\n";
		istatus++;
		}
	 KeysList.add(FPSTR(KEY_BAUD_RATE_OPTIONS_LIST));
	 ValuesList.add(stmp);
	 //Sleep Mode
	 istatus = 0;
	stmp="";
	while (bmodemvaluelist[istatus]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(bmodemvaluelist[istatus]);
		stmp+="\" ";
		if (bmodemvaluelist[istatus]==bsleepmode)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=smodemdisplaylist[istatus];
		stmp+= "</OPTION>\n";
		istatus++;
		}
	 KeysList.add(FPSTR(KEY_SLEEP_MODE_OPTIONS_LIST));
	 ValuesList.add(stmp);
	 
	 //Web port
	 KeysList.add(FPSTR(KEY_WEB_PORT));
	 ValuesList.add(intTostr(iweb_port));
	 
	 //Data port
	KeysList.add(FPSTR(KEY_DATA_PORT));
	ValuesList.add(intTostr(idata_port));
	if (msg_alert_error)
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add(smsg);
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	else if (msg_alert_success)
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add(smsg);
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add(FPSTR(RESTARTCMD));
		KeysList.add(FPSTR(KEY_BAUD_RATE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_SLEEP_MODE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_WEB_PORT_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_DATA_PORT_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
	}
	
	else
	
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	
	//process the template file and provide list of variables
	if(KeysList.size()==ValuesList.size())	//Sanity check
		processTemplate("/system.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}

void handle_web_interface_configAP()
{
	String stmp,smsg;
	String sSSID,sPassword,sIP,sGW,sMask;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
    byte visible_buf;
    byte static_ip_buf;
    byte auth_buf;
    byte channel_buf;
    byte phy_mode_buf;
    byte ip_sav[4];
	byte gw_sav[4];
	byte msk_sav[4];
	int ipos;
	int inetworkvaluelist []={PHY_MODE_11B,PHY_MODE_11G,-1};
	const __FlashStringHelper  * inetworkdisplaylist []={FPSTR(VALUE_11B),FPSTR(VALUE_11G),FPSTR(VALUE_11B)};
	int iauthvaluelist[]={	AUTH_OPEN,AUTH_WPA_PSK,AUTH_WPA2_PSK,AUTH_WPA_WPA2_PSK,AUTH_MAX,-1};
	const __FlashStringHelper  * iauthdisplaylist []={FPSTR(VALUE_NONE),FPSTR(VALUE_WPA),FPSTR(VALUE_WPA2),FPSTR(VALUE_WPAWPA2),FPSTR(VALUE_MAX),FPSTR(VALUE_MAX)};
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
	//Free Mem, put at the end to reflect situation
	KeysList.add(FPSTR(KEY_FREE_MEM));
	ValuesList.add(intTostr(system_get_free_heap_size()));
	//IP
	stmp=FPSTR(KEY_IP);
	KeysList.add(stmp);
	if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
	else stmp=WiFi.softAPIP().toString();
	ValuesList.add(stmp);
	//Web address = ip + port
	KeysList.add(FPSTR(KEY_WEB_ADDRESS));
	if (wifi_config.iweb_port!=80)
		{
		stmp+=":";
		stmp+=intTostr(wifi_config.iweb_port);
		}
	ValuesList.add(stmp);
	//mode
	if (wifi_get_opmode()==WIFI_STA )
		{
		KeysList.add(FPSTR(KEY_MODE));
		ValuesList.add(FPSTR(VALUE_STA));
		}
	else
		{
		if (wifi_get_opmode()==WIFI_AP )
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP));
			}
		else
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP_STA));
			}
		}
	//FW Version
	KeysList.add(FPSTR(KEY_FW_VER));
	ValuesList.add(FPSTR(VALUE_FW_VERSION));
	//page title
	KeysList.add(FPSTR(KEY_PAGE_TITLE));
	ValuesList.add(FPSTR(VALUE_CONFIG_AP));
	//tpl file name with extension
	KeysList.add(FPSTR(KEY_FILE_NAME));
	ValuesList.add("config_ap.tpl");
	//tpl file name without extension
	KeysList.add(FPSTR(KEY_SHORT_FILE_NAME));
	ValuesList.add("config_ap");
	//menu item
	KeysList.add(FPSTR(KEY_MENU_AP));
	ValuesList.add(FPSTR(VALUE_ACTIVE));

  //check is it is a submission or a display
  smsg="";
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  if (web_interface->WebServer.hasArg("SSID") && web_interface->WebServer.hasArg("PASSWORD")&& web_interface->WebServer.hasArg("NETWORK")
	      && web_interface->WebServer.hasArg("AUTHENTIFICATION")&& web_interface->WebServer.hasArg("IP")
	      && web_interface->WebServer.hasArg("GATEWAY")&& web_interface->WebServer.hasArg("SUBNET")
	      && web_interface->WebServer.hasArg("CHANNEL"))
		{	
			//SSID
		    web_interface->urldecode(sSSID,web_interface->WebServer.arg("SSID").c_str());
		    if (!web_interface->isSSIDValid(sSSID.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect SSID<BR>";
				KeysList.add(FPSTR(KEY_AP_SSID_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
		    //Password
		    web_interface->urldecode(sPassword,web_interface->WebServer.arg("PASSWORD").c_str());
		    if (!web_interface->isPasswordValid(sPassword.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect password<BR>";
				KeysList.add(FPSTR(KEY_AP_PASSWORD_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			//ssid visible ?	
			if (web_interface->WebServer.hasArg("SSID_VISIBLE")) 
				{
					visible_buf=1;
				}
			else
				{
					visible_buf=0;
				}
			//phy mode
			phy_mode_buf  = byte(web_interface->WebServer.arg("NETWORK").toInt());
			if (!(phy_mode_buf==PHY_MODE_11B||phy_mode_buf==PHY_MODE_11G) )
				 {
					msg_alert_error=true;
					smsg+="Error : Incorrect network<BR>";
					KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				 }
			//channel
			channel_buf  = byte (web_interface->WebServer.arg("CHANNEL").toInt());
			if (channel_buf< 1|| channel_buf>11) 
				 {
					msg_alert_error=true;
					smsg+="Error : Incorrect channel<BR>";
					KeysList.add(FPSTR(KEY_CHANNEL_OPTION_LIST_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				 }
			//authentification
			auth_buf  = byte(web_interface->WebServer.arg("AUTHENTIFICATION").toInt());
			if (!(auth_buf==AUTH_OPEN||auth_buf==AUTH_WEP||auth_buf==AUTH_WPA_PSK||auth_buf==AUTH_WPA2_PSK||auth_buf==AUTH_WPA_WPA2_PSK||auth_buf==AUTH_MAX) )
				 {
					msg_alert_error=true;
					smsg+="Error : Incorrect authentification method<BR>";
					KeysList.add(FPSTR(KEY_AUTH_OPTION_LIST_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				 }	
		    //Static IP ?	
			if (web_interface->WebServer.hasArg("STATIC_IP") )
				{
					static_ip_buf=STATIC_IP_MODE;
				}
			else
				{
					static_ip_buf=DHCP_MODE;
				}
				
			//IP
			web_interface->urldecode(sIP,web_interface->WebServer.arg("IP").c_str());
			if (!web_interface->isIPValid(sIP.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect IP fortmat<BR>";
				KeysList.add(FPSTR(KEY_AP_IP_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}

			//Gateway
			web_interface->urldecode(sGW,web_interface->WebServer.arg("GATEWAY").c_str());
			if (!web_interface->isIPValid(sGW.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect gateway<BR>";
				KeysList.add(FPSTR(KEY_AP_GW_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			//subnet
			web_interface->urldecode(sMask,web_interface->WebServer.arg("SUBNET").c_str());
			if (!web_interface->isIPValid(sMask.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect subnet<BR>";
				KeysList.add(FPSTR(KEY_AP_SUBNET_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}   	  	    
		}
      else
	   {
		msg_alert_error=true;
		smsg="Error : Missing data";
	   }
	  
	   //if no error apply the change
	   if (msg_alert_error==false)
		{
		//save
		
		 wifi_config.split_ip(sIP.c_str(),ip_sav);
		 wifi_config.split_ip(sGW.c_str(),gw_sav);
		 wifi_config.split_ip(sMask.c_str(),msk_sav);
		 if((!CONFIG::write_byte(EP_WIFI_MODE,AP_MODE))||
			(!CONFIG::write_string(EP_SSID,sSSID.c_str()))||
			(!CONFIG::write_string(EP_PASSWORD,sPassword.c_str()))||
			(!CONFIG::write_byte(EP_SSID_VISIBLE,visible_buf))||
			(!CONFIG::write_byte(EP_PHY_MODE,phy_mode_buf))||
			(!CONFIG::write_byte(EP_CHANNEL,channel_buf)) ||
			(!CONFIG::write_byte(EP_AUTH_TYPE,auth_buf)) ||
			(!CONFIG::write_byte(EP_IP_MODE,static_ip_buf)) ||
			(!CONFIG::write_buffer(EP_IP_VALUE,ip_sav,IP_LENGTH))||
			(!CONFIG::write_buffer(EP_GATEWAY_VALUE,gw_sav,IP_LENGTH))||
			(!CONFIG::write_buffer(EP_MASK_VALUE,msk_sav,IP_LENGTH)))
			{
				msg_alert_error=true;
			    smsg="Error : Cannot write to EEPROM";
			}
		else
				{
					msg_alert_success=true;
					smsg="Changes saved to EEPROM, restarting....";
				}
			}
		}
  
