luc-github/ESP3D/esp8266/webinterface.cpp
	else //no submit need to get data from EEPROM
	{
	//ssid
	if (!CONFIG::read_string(EP_SSID, sSSID , MAX_SSID_LENGTH) )sSSID=FPSTR(DEFAULT_SSID);
	//password 
	if (!CONFIG::read_string(EP_PASSWORD, sPassword , MAX_PASSWORD_LENGTH) )sPassword=FPSTR(DEFAULT_PASSWORD);
	//ssid visible ?
	if (!CONFIG::read_byte(EP_SSID_VISIBLE, &visible_buf ))visible_buf=DEFAULT_SSID_VISIBLE;
	//phy mode
	if (!CONFIG::read_byte(EP_PHY_MODE, &phy_mode_buf ))phy_mode_buf=DEFAULT_PHY_MODE;
	//authentification
	if (!CONFIG::read_byte(EP_AUTH_TYPE, &auth_buf ))auth_buf=DEFAULT_AUTH_TYPE;
	//channel
	if (!CONFIG::read_byte(EP_CHANNEL, &channel_buf ))channel_buf=DEFAULT_CHANNEL;
	//static IP ?
	if (!CONFIG::read_byte(EP_IP_MODE, &static_ip_buf ))static_ip_buf=DEFAULT_IP_MODE;
	//IP for static IP
	if (!CONFIG::read_buffer(EP_IP_VALUE,ip_sav , IP_LENGTH) )
		sIP=wifi_config.ip2str((byte *)DEFAULT_IP_VALUE);
	else
		sIP=wifi_config.ip2str(ip_sav);  
	//GW for static IP
	if (!CONFIG::read_buffer(EP_GATEWAY_VALUE,gw_sav , IP_LENGTH) )
		sGW=wifi_config.ip2str((byte *)DEFAULT_GATEWAY_VALUE);
	else
		sGW=wifi_config.ip2str(gw_sav);  
	
	//Subnet for static IP
	if (!CONFIG::read_buffer(EP_MASK_VALUE,msk_sav , IP_LENGTH) )
		sMask=wifi_config.ip2str((byte *)DEFAULT_MASK_VALUE);
	else
		sMask=wifi_config.ip2str(msk_sav);  
	}
	
	//Display values
	
  //ssid
	KeysList.add(FPSTR(KEY_AP_SSID));
	ValuesList.add(sSSID);
	
	//password
	KeysList.add(FPSTR(KEY_AP_PASSWORD));
	ValuesList.add(sPassword);

	//ssid visible ?
	KeysList.add(FPSTR(KEY_IS_SSID_VISIBLE));
	if (visible_buf==1)ValuesList.add(VALUE_CHECKED);
	else ValuesList.add("");
  
	//network
	ipos = 0;
	stmp="";
	while (inetworkvaluelist[ipos]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(inetworkvaluelist[ipos]);
		stmp+="\" ";
		if (inetworkvaluelist[ipos]==phy_mode_buf)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=inetworkdisplaylist[ipos];
		stmp+= "</OPTION>\n";
		ipos++;
		}
	 KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST));
	 ValuesList.add(stmp);
	 
	 //channel
	 stmp ="";
	  for (int c=1;c < 12;c++)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+=intTostr(c);
		stmp+="\" ";
		if (channel_buf==c)stmp += FPSTR(VALUE_SELECTED);
		else stmp+="";
		stmp+=" >";
		stmp+=intTostr(c);
		stmp+= "</OPTION>\n";
		}
  
	 KeysList.add(FPSTR(KEY_CHANNEL_OPTION_LIST));
	 ValuesList.add(stmp);
	//auth
	ipos = 0;
	stmp="";
	while (iauthvaluelist[ipos]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(iauthvaluelist[ipos]);
		stmp+="\" ";
		if (iauthvaluelist[ipos]==auth_buf)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=iauthdisplaylist[ipos];
		stmp+= "</OPTION>\n";
		ipos++;
		}
	 KeysList.add(FPSTR(KEY_AUTH_OPTION_LIST));
	 ValuesList.add(stmp);

	 //static IP ?
	KeysList.add(FPSTR(KEY_IS_STATIC_IP));
	if (static_ip_buf==STATIC_IP_MODE)ValuesList.add(VALUE_CHECKED);
	else ValuesList.add("");
	
	//IP for static IP
	KeysList.add(FPSTR(KEY_AP_IP));
	ValuesList.add(sIP);
	 
	//Gateway for static IP
	KeysList.add(FPSTR(KEY_AP_GW));
	ValuesList.add(sGW);
	  
	//Mask for static IP
	KeysList.add(FPSTR(KEY_AP_SUBNET));
	ValuesList.add(sMask);

if (msg_alert_error)
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add(smsg);
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	else if (msg_alert_success)
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add(smsg);
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add(FPSTR(RESTARTCMD));
		//Add all green
		KeysList.add(FPSTR(KEY_AP_SSID_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_PASSWORD_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_IS_SSID_VISIBLE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_CHANNEL_OPTION_LIST_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AUTH_OPTION_LIST_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_STATIC_IP_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_IP_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_GW_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_SUBNET_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
	}
	
	else
	
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	//process the template file and provide list of variables
	if(KeysList.size()==ValuesList.size())	//Sanity check
		processTemplate("/config_ap.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}


void handle_web_interface_configSTA()
{
	String stmp,smsg;
	String sSSID,sPassword,sIP,sGW,sMask,sHostname;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
    byte static_ip_buf;
    byte phy_mode_buf;
    byte ip_sav[4];
	byte gw_sav[4];
	byte msk_sav[4];
	bool revertSTA=false;
	int ipos;
	int inetworkvaluelist []={PHY_MODE_11B,PHY_MODE_11G,PHY_MODE_11N,-1};
	const __FlashStringHelper  * inetworkdisplaylist []={FPSTR(VALUE_11B),FPSTR(VALUE_11G),FPSTR(VALUE_11N),FPSTR(VALUE_11B)};
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
	//Free Mem, put at the end to reflect situation
	KeysList.add(FPSTR(KEY_FREE_MEM));
	ValuesList.add(intTostr(system_get_free_heap_size()));
	//IP
	stmp=FPSTR(KEY_IP);
	KeysList.add(stmp);
	if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
	else stmp=WiFi.softAPIP().toString();
	ValuesList.add(stmp);
	//Web address = ip + port
	KeysList.add(FPSTR(KEY_WEB_ADDRESS));
	if (wifi_config.iweb_port!=80)
		{
		stmp+=":";
		stmp+=intTostr(wifi_config.iweb_port);
		}
	ValuesList.add(stmp);
	//mode
	if (wifi_get_opmode()==WIFI_STA )
		{
		KeysList.add(FPSTR(KEY_MODE));
		ValuesList.add(FPSTR(VALUE_STA));
		}
	else
		{
		if (wifi_get_opmode()==WIFI_AP )
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP));
			}
		else
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP_STA));
			}
		}
		
