luc-github/ESP3D/esp8266/webinterface.cpp
	//FW Version
	KeysList.add(FPSTR(KEY_FW_VER));
	ValuesList.add(FPSTR(VALUE_FW_VERSION));
	//page title
	KeysList.add(FPSTR(KEY_PAGE_TITLE));
	ValuesList.add(FPSTR(VALUE_CONFIG_STA));
	//tpl file name with extension
	KeysList.add(FPSTR(KEY_FILE_NAME));
	ValuesList.add("config_sta.tpl");
	//tpl file name without extension
	KeysList.add(FPSTR(KEY_SHORT_FILE_NAME));
	ValuesList.add("config_sta");
	//menu item
	KeysList.add(FPSTR(KEY_MENU_STA));
	ValuesList.add(FPSTR(VALUE_ACTIVE));
	
  smsg="";
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  if (web_interface->WebServer.hasArg("SSID") && web_interface->WebServer.hasArg("PASSWORD")&& web_interface->WebServer.hasArg("NETWORK")
	     && web_interface->WebServer.hasArg("IP") && web_interface->WebServer.hasArg("GATEWAY")&& web_interface->WebServer.hasArg("SUBNET")
	     && web_interface->WebServer.hasArg("HOSTNAME"))
		{	
			//SSID
		    web_interface->urldecode(sSSID,web_interface->WebServer.arg("SSID").c_str());
		    if (!web_interface->isSSIDValid(sSSID.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect SSID<BR>";
				KeysList.add(FPSTR(KEY_STA_SSID_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}

			//Password
		    web_interface->urldecode(sPassword,web_interface->WebServer.arg("PASSWORD").c_str());
		    if (!web_interface->isPasswordValid(sPassword.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect password<BR>";
				KeysList.add(FPSTR(KEY_STA_PASSWORD_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
				
			//Hostname
		    web_interface->urldecode(sHostname,web_interface->WebServer.arg("HOSTNAME").c_str());
		    if (!web_interface->isHostnameValid(sHostname.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect hostname<BR>";
				KeysList.add(FPSTR(KEY_HOSTNAME_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			
			//phy mode
			phy_mode_buf  = byte(web_interface->WebServer.arg("NETWORK").toInt());
			if (!(phy_mode_buf==PHY_MODE_11B||phy_mode_buf==PHY_MODE_11G||phy_mode_buf==PHY_MODE_11N) )
				 {
					msg_alert_error=true;
					smsg+="Error : Incorrect network<BR>";
					KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				 }
				 
		   //Static IP ?	
			if (web_interface->WebServer.hasArg("STATIC_IP") )
				{
					static_ip_buf=STATIC_IP_MODE;
				}
			else
				{
					static_ip_buf=DHCP_MODE;
				}
				
			//IP
			web_interface->urldecode(sIP,web_interface->WebServer.arg("IP").c_str());
			if (!web_interface->isIPValid(sIP.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect IP fortmat<BR>";
				KeysList.add(FPSTR(KEY_STA_IP_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}

			//Gateway
			web_interface->urldecode(sGW,web_interface->WebServer.arg("GATEWAY").c_str());
			if (!web_interface->isIPValid(sGW.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect gateway<BR>";
				KeysList.add(FPSTR(KEY_STA_GW_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			//subnet
			web_interface->urldecode(sMask,web_interface->WebServer.arg("SUBNET").c_str());
			if (!web_interface->isIPValid(sMask.c_str()))
				{
				msg_alert_error=true;
				smsg+="Error : Incorrect subnet<BR>";
				KeysList.add(FPSTR(KEY_STA_SUBNET_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}   	  	    
		}
     else
	   {
		msg_alert_error=true;
		smsg="Error : Missing data";
	   }
	   
	   
	   //no error ? then save
	   if (msg_alert_error==false)
		{
		//save
		 wifi_config.split_ip(sIP.c_str(),ip_sav);
		 wifi_config.split_ip(sGW.c_str(),gw_sav);
		 wifi_config.split_ip(sMask.c_str(),msk_sav);
		 if((!CONFIG::write_byte(EP_WIFI_MODE,CLIENT_MODE))||
			(!CONFIG::write_string(EP_SSID,sSSID.c_str()))||
			(!CONFIG::write_string(EP_PASSWORD,sPassword.c_str()))||
			(!CONFIG::write_string(EP_HOSTNAME,sHostname.c_str()))||
			(!CONFIG::write_byte(EP_PHY_MODE,phy_mode_buf))||
			(!CONFIG::write_byte(EP_IP_MODE,static_ip_buf)) ||
			(!CONFIG::write_buffer(EP_IP_VALUE,ip_sav,IP_LENGTH))||
			(!CONFIG::write_buffer(EP_GATEWAY_VALUE,gw_sav,IP_LENGTH))||
			(!CONFIG::write_buffer(EP_MASK_VALUE,msk_sav,IP_LENGTH)))
			{
				msg_alert_error=true;
			    smsg="Error : Cannot write to EEPROM";
			}
		else
				{
					msg_alert_success=true;
					smsg="Changes saved to EEPROM, restarting....";
				}
			}
		}
	else //no submit need to get data from EEPROM
	{
	//ssid
	if (!CONFIG::read_string(EP_SSID, sSSID , MAX_SSID_LENGTH) )sSSID=FPSTR(DEFAULT_SSID);
	//password 
	if (!CONFIG::read_string(EP_PASSWORD, sPassword , MAX_PASSWORD_LENGTH) )sPassword=FPSTR(DEFAULT_PASSWORD);
	//hostname 
	if (!CONFIG::read_string(EP_HOSTNAME, sHostname , MAX_HOSTNAME_LENGTH) )sHostname=wifi_config.get_default_hostname();
	//phy mode
	if (!CONFIG::read_byte(EP_PHY_MODE, &phy_mode_buf ))phy_mode_buf=DEFAULT_PHY_MODE;
	//static IP ?
	if (!CONFIG::read_byte(EP_IP_MODE, &static_ip_buf ))static_ip_buf=DEFAULT_IP_MODE;
	//IP for static IP
	if (!CONFIG::read_buffer(EP_IP_VALUE,ip_sav , IP_LENGTH) )
		sIP=wifi_config.ip2str((byte *)DEFAULT_IP_VALUE);
	else
		sIP=wifi_config.ip2str(ip_sav);  
	//GW for static IP
	if (!CONFIG::read_buffer(EP_GATEWAY_VALUE,gw_sav , IP_LENGTH) )
		sGW=wifi_config.ip2str((byte *)DEFAULT_GATEWAY_VALUE);
	else
		sGW=wifi_config.ip2str(gw_sav);  
	//Subnet for static IP
	if (!CONFIG::read_buffer(EP_MASK_VALUE,msk_sav , IP_LENGTH) )
		sMask=wifi_config.ip2str((byte *)DEFAULT_MASK_VALUE);
	else
		sMask=wifi_config.ip2str(msk_sav);  
	}
	//Display values
	//ssid
	KeysList.add(FPSTR(KEY_STA_SSID));
	ValuesList.add(sSSID);
	
	//password
	KeysList.add(FPSTR(KEY_STA_PASSWORD));
	ValuesList.add(sPassword);
	
	//hostname
	KeysList.add(FPSTR(KEY_HOSTNAME));
	ValuesList.add(sHostname);
  
	//network
	ipos = 0;
	stmp="";
	while (inetworkvaluelist[ipos]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(inetworkvaluelist[ipos]);
		stmp+="\" ";
		if (inetworkvaluelist[ipos]==phy_mode_buf)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=inetworkdisplaylist[ipos];
		stmp+= "</OPTION>\n";
		ipos++;
		}
	 KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST));
	 ValuesList.add(stmp);
	 
