luc-github/ESP3D/esp8266/webinterface.cpp
	 //static IP ?
	KeysList.add(FPSTR(KEY_IS_STATIC_IP));
	if (static_ip_buf==STATIC_IP_MODE)ValuesList.add(VALUE_CHECKED);
	else ValuesList.add("");
	
	//IP for static IP
	KeysList.add(FPSTR(KEY_STA_IP));
	ValuesList.add(sIP);
	 
	//Gateway for static IP
	KeysList.add(FPSTR(KEY_STA_GW));
	ValuesList.add(sGW);
	  
	//Mask for static IP
	KeysList.add(FPSTR(KEY_STA_SUBNET));
	ValuesList.add(sMask);
	
	//do we need to do a scan and display it ?
	 if (!msg_alert_success)
		 {
			   //if in AP mode switch to mixed mode to be able to scan
			  if (wifi_get_opmode()!=WIFI_STA )
				{
					WiFi.mode(WIFI_AP_STA);
					revertSTA=true;
				}
				
			  int n = WiFi.scanNetworks();
			  for (int i = 0; i < n; ++i)
				{
				   //row number
				  stmp = "$ROW_NUMBER["+String(i)+"]$";
				  KeysList.add(stmp);
				  stmp=String(i+1);
				  ValuesList.add(stmp);
				  //SSID
				stmp = "$AP_SSID["+String(i)+"]$";
				KeysList.add(stmp);
				ValuesList.add(WiFi.SSID(i).c_str());
				//signal strenght
				 stmp = "$AP_SIGNAL["+String(i)+"]$";
				 KeysList.add(stmp);
				 stmp = intTostr(100+WiFi.RSSI(i)) ;
				 stmp += "%";
				 ValuesList.add(stmp);
				//is protected
				stmp = "$IS_PROTECTED["+String(i)+"]$";
				 KeysList.add(stmp);
				 if (WiFi.encryptionType(i) == ENC_TYPE_NONE)  ValuesList.add(FPSTR(VALUE_NO));
				 else  ValuesList.add(FPSTR(VALUE_YES));
				}
			WiFi.scanDelete();
			KeysList.add(FPSTR(KEY_AVAILABLE_AP_NB_ITEMS));
			ValuesList.add(intTostr(n));
				 
		  //revert to pure softAP
		   if (revertSTA) WiFi.mode(WIFI_AP);
		   KeysList.add(FPSTR(KEY_AP_SCAN_VISIBILITY));
		   ValuesList.add(VALUE_ITEM_VISIBLE);
		  }
	else
		{//no need to do a scan if we are going to restart
		KeysList.add(FPSTR(KEY_AP_SCAN_VISIBILITY));
	   ValuesList.add(VALUE_ITEM_HIDDEN);
	   KeysList.add(FPSTR(KEY_AVAILABLE_AP_NB_ITEMS));
	  ValuesList.add(intTostr(0));
		}

if (msg_alert_error)
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add(smsg);
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	else if (msg_alert_success)
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add(smsg);
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add(FPSTR(RESTARTCMD));
		//Add all green
		KeysList.add(FPSTR(KEY_STA_SSID_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_PASSWORD_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_STATIC_IP_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_IP_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_GW_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_SUBNET_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_HOSTNAME_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
	}
	
	else
	
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	
	//process the template file and provide list of variables
	if(KeysList.size()==ValuesList.size())	//Sanity check
		processTemplate("/config_sta.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}


void handle_web_interface_printer()
{
	String stmp,smsg;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
	//Free Mem, put at the end to reflect situation
	KeysList.add(FPSTR(KEY_FREE_MEM));
	ValuesList.add(intTostr(system_get_free_heap_size()));
	//IP
	stmp=FPSTR(KEY_IP);
	KeysList.add(stmp);
	if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
	else stmp=WiFi.softAPIP().toString();
	ValuesList.add(stmp);
	//Web address = ip + port
	KeysList.add(FPSTR(KEY_WEB_ADDRESS));
	if (wifi_config.iweb_port!=80)
		{
		stmp+=":";
		stmp+=intTostr(wifi_config.iweb_port);
		}
	ValuesList.add(stmp);
	//mode
	if (wifi_get_opmode()==WIFI_STA )
		{
		KeysList.add(FPSTR(KEY_MODE));
		ValuesList.add(FPSTR(VALUE_STA));
		}
	else
		{
		if (wifi_get_opmode()==WIFI_AP )
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP));
			}
		else
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP_STA));
			}
		}
	//FW Version
	KeysList.add(FPSTR(KEY_FW_VER));
	ValuesList.add(FPSTR(VALUE_FW_VERSION));
	//page title
	KeysList.add(FPSTR(KEY_PAGE_TITLE));
	ValuesList.add(FPSTR(VALUE_PRINTER));
	//tpl file name with extension
	KeysList.add(FPSTR(KEY_FILE_NAME));
	ValuesList.add("printer.tpl");
	//tpl file name without extension
	KeysList.add(FPSTR(KEY_SHORT_FILE_NAME));
	ValuesList.add("printer");
	//menu item
	KeysList.add(FPSTR(KEY_MENU_PRINTER));
	ValuesList.add(FPSTR(VALUE_ACTIVE));
	
	//Refresh page time
	KeysList.add(FPSTR(KEY_REFRESH_PAGE));
	byte bflag;
	if (!CONFIG::read_byte(EP_REFRESH_PAGE_TIME, &bflag ))ValuesList.add(intTostr(DEFAULT_REFRESH_PAGE_TIME*1000));
    else ValuesList.add(intTostr(1000*bflag));
    int istatus;
    //xy feedrate
	KeysList.add(FPSTR(KEY_XY_FEEDRATE));
	if (!CONFIG::read_buffer(EP_XY_FEEDRATE,  (byte *)&istatus , INTEGER_LENGTH))istatus=DEFAULT_XY_FEEDRATE;
	ValuesList.add(intTostr(istatus));
	//Z feedrate
	KeysList.add(FPSTR(KEY_Z_FEEDRATE));
	if (!CONFIG::read_buffer(EP_Z_FEEDRATE,  (byte *)&istatus , INTEGER_LENGTH))istatus=DEFAULT_Z_FEEDRATE;
	ValuesList.add(intTostr(istatus));
	//E feedrate
	KeysList.add(FPSTR(KEY_E_FEEDRATE));
	if (!CONFIG::read_buffer(EP_E_FEEDRATE,  (byte *)&istatus , INTEGER_LENGTH))istatus=DEFAULT_E_FEEDRATE;
	ValuesList.add(intTostr(istatus));

	 //Serial.println("M114");
	Serial.println("M220");
	Serial.println("M221");
    KeysList.add(FPSTR(KEY_SERVICE_PAGE));
	ValuesList.add("");
	
	if(KeysList.size()==ValuesList.size())	//Sanity check
		processTemplate("/printer.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}

