luc-github/ESP3D/esp8266/webinterface.cpp
void handle_web_settings()
{
	String stmp,smsg;
	int istatus;
	byte bbuf;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
	byte irefresh_page;
	int ixy_feedrate,iz_feedrate,ie_feedrate;
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
	//Free Mem, put at the end to reflect situation
	KeysList.add(FPSTR(KEY_FREE_MEM));
	ValuesList.add(intTostr(system_get_free_heap_size()));
	//IP
	stmp=FPSTR(KEY_IP);
	KeysList.add(stmp);
	if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
	else stmp=WiFi.softAPIP().toString();
	ValuesList.add(stmp);
	//Web address = ip + port
	KeysList.add(FPSTR(KEY_WEB_ADDRESS));
	if (wifi_config.iweb_port!=80)
		{
		stmp+=":";
		stmp+=intTostr(wifi_config.iweb_port);
		}
	ValuesList.add(stmp);
	//mode
	if (wifi_get_opmode()==WIFI_STA )
		{
		KeysList.add(FPSTR(KEY_MODE));
		ValuesList.add(FPSTR(VALUE_STA));
		}
	else
		{
		if (wifi_get_opmode()==WIFI_AP )
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP));
			}
		else
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP_STA));
			}
		}
	//FW Version
	KeysList.add(FPSTR(KEY_FW_VER));
	ValuesList.add(FPSTR(VALUE_FW_VERSION));
	//page title
	KeysList.add(FPSTR(KEY_PAGE_TITLE));
	ValuesList.add(FPSTR(VALUE_SETTINGS));
	//tpl file name with extension
	KeysList.add(FPSTR(KEY_FILE_NAME));
	ValuesList.add("settings.tpl");
	//tpl file name without extension
	KeysList.add(FPSTR(KEY_SHORT_FILE_NAME));
	ValuesList.add("settings");
	//menu item
	KeysList.add(FPSTR(KEY_MENU_SETTINGS));
	ValuesList.add(FPSTR(VALUE_ACTIVE));

  //check is it is a submission or a display
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  	  if (web_interface->WebServer.hasArg("REFRESH_PAGE") && web_interface->WebServer.hasArg("XY_FEEDRATE")&& web_interface->WebServer.hasArg("Z_FEEDRATE")&& web_interface->WebServer.hasArg("E_FEEDRATE"))
		{   //is each value correct ?
			irefresh_page  = web_interface->WebServer.arg("REFRESH_PAGE").toInt();
			ixy_feedrate  = web_interface->WebServer.arg("XY_FEEDRATE").toInt();
			iz_feedrate  = web_interface->WebServer.arg("Z_FEEDRATE").toInt();
			ie_feedrate = web_interface->WebServer.arg("E_FEEDRATE").toInt();

			if (!(irefresh_page>1 && irefresh_page<120))
				{
					msg_alert_error=true;
					smsg+="Error : invalid value for refresh time<BR>";
					KeysList.add(FPSTR(KEY_REFRESH_PAGE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			 if (!(ixy_feedrate>0 && ixy_feedrate<9999))
				{
					msg_alert_error=true;
					smsg+="Error : invalid value for XY axis feedrate<BR>";
					KeysList.add(FPSTR(KEY_XY_FEEDRATE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			 if (!(iz_feedrate>0 && iz_feedrate<9999))
				{
					msg_alert_error=true;
					smsg+="Error : invalid value for Z axis feedrate<BR>";
					KeysList.add(FPSTR(KEY_Z_FEEDRATE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			if (!(ie_feedrate>0 && ie_feedrate<9999))
				{
					msg_alert_error=true;
					smsg+="Error : invalid value for Extruder feedrate<BR>";
					KeysList.add(FPSTR(KEY_XY_FEEDRATE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
	  }
	  else
	   {
		msg_alert_error=true;
		smsg="Error : Missing data";
	   }
	   //if no error apply the changes
		if (msg_alert_error!=true)
			{
			 if(!CONFIG::write_buffer(EP_XY_FEEDRATE,(const byte *)&ixy_feedrate,INTEGER_LENGTH)||!CONFIG::write_buffer(EP_Z_FEEDRATE,(const byte *)&iz_feedrate,INTEGER_LENGTH)||!CONFIG::write_buffer(EP_E_FEEDRATE,(const byte *)&ie_feedrate,INTEGER_LENGTH)||!CONFIG::write_byte(EP_REFRESH_PAGE_TIME,irefresh_page))
				{
					msg_alert_error=true;
					smsg="Error : Cannot write to EEPROM";
				}
			else
				{
					msg_alert_success=true;
					smsg="Changes saved to EEPROM";
				}
			}
		
  }
  else //no submit need to get data from EEPROM
	{
	if (!CONFIG::read_buffer(EP_XY_FEEDRATE,  (byte *)&ixy_feedrate , INTEGER_LENGTH))ixy_feedrate=DEFAULT_XY_FEEDRATE;
	if (!CONFIG::read_byte(EP_REFRESH_PAGE_TIME, &irefresh_page ))irefresh_page=DEFAULT_REFRESH_PAGE_TIME;
	if (!CONFIG::read_buffer(EP_Z_FEEDRATE,  (byte *)&iz_feedrate , INTEGER_LENGTH))iz_feedrate=DEFAULT_Z_FEEDRATE;
	if (!CONFIG::read_buffer(EP_E_FEEDRATE,  (byte *)&ie_feedrate , INTEGER_LENGTH))ie_feedrate=DEFAULT_E_FEEDRATE;
	}
	//fill the variables
	//refresh page
	KeysList.add(FPSTR(KEY_REFRESH_PAGE));
	ValuesList.add(intTostr(irefresh_page));
	//xy feedrate
	KeysList.add(FPSTR(KEY_XY_FEEDRATE));
	ValuesList.add(intTostr(ixy_feedrate));
	//Z feedrate
	KeysList.add(FPSTR(KEY_Z_FEEDRATE));
	ValuesList.add(intTostr(iz_feedrate));
	//E feedrate
	KeysList.add(FPSTR(KEY_E_FEEDRATE));
	ValuesList.add(intTostr(ie_feedrate));
	
	if (msg_alert_error)
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add(smsg);
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	else if (msg_alert_success)
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add(smsg);
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_REFRESH_PAGE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_XY_FEEDRATE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_Z_FEEDRATE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_E_FEEDRATE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	
	else
	
	{
		KeysList.add(FPSTR(KEY_ERROR_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_SUCCESS_MSG));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	
	//process the template file and provide list of variables
	if(KeysList.size()==ValuesList.size())	//Sanity check
		processTemplate("/settings.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}



void handle_web_interface_status()
{
	Serial.println("M114");
	int tagpos,tagpos2;
	String buffer2send;
	String value;
	int temperature,target;
	//request temperature only if no feedback
	if ((system_get_time()-web_interface->last_temp)>2000000)
		Serial.println("M105");
	if ((system_get_time()-web_interface->last_temp)<3200000)
		{
		value="Connected";
		}
	else if ((system_get_time()-web_interface->last_temp)<32000000)
		{
		value="Busy";
		}
	else 
		{
		value="Offline";
		}
	//start JSON answer
	buffer2send="{";
	//status color
	buffer2send+="\"status\":\""+value +"\",";
	//speed
	buffer2send+="\"speed\":\""+web_interface->answer4M220 +"\",";
	//flow
	buffer2send+="\"flow\":\""+web_interface->answer4M221 +"\",";
	//X position
	tagpos = web_interface->answer4M114.indexOf("X:");
	tagpos2 = web_interface->answer4M114.indexOf(" ",tagpos);
	value=web_interface->answer4M114.substring(tagpos+2,tagpos2);
	buffer2send+="\"Xpos\":\""+value +"\",";
	//Y position
	tagpos = web_interface->answer4M114.indexOf("Y:");
	tagpos2 = web_interface->answer4M114.indexOf(" ",tagpos);
	value=web_interface->answer4M114.substring(tagpos+2,tagpos2);
	buffer2send+="\"Ypos\":\""+value +"\",";
	//Z position
	tagpos = web_interface->answer4M114.indexOf("Z:");
	tagpos2 = web_interface->answer4M114.indexOf(" ",tagpos);
	value=web_interface->answer4M114.substring(tagpos+2,tagpos2);
	buffer2send+="\"Zpos\":\""+value +"\",";
	//heater
	buffer2send+="\"heater\":[";
	//extruder 1
	buffer2send+="{\"name\":\"Extruder 1\",";
	int Tpos = web_interface->answer4M105.indexOf("T0:");
	byte bshift=1;
	if (Tpos==-1)
		{
		Tpos = web_interface->answer4M105.indexOf("T:");
		bshift=0;
		}
	int slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
	int spacepos = web_interface->answer4M105.indexOf(" ",slashpos+2);
	//have Extruder 1 ?
	if(slashpos!=-1 && spacepos!=-1 )
			{
			buffer2send+="\"temperature\":\""+web_interface->answer4M105.substring(Tpos+2+bshift,slashpos)+"\",\"target\":\""+web_interface->answer4M105.substring(slashpos+2,spacepos)+"\",\"active\":\"1\"";
			}
	else{//no extruder temperature
			buffer2send+="\"temperature\":\"0\",\"target\":\"0\",\"active\":\"0\"";
			}
	
	buffer2send+="},";
	//Extruder 2
	buffer2send+="{\"name\":\"Extruder 2\",";
	Tpos = web_interface->answer4M105.indexOf("T1:");
	if (Tpos>-1) //have extruder 2 ?
		{
		slashpos = web_interface->answer4M105.indexOf(" /",Tpos);
		spacepos = web_interface->answer4M105.indexOf(" ",slashpos+2);
		if(slashpos!=-1 && spacepos!=-1 )
			{
			buffer2send+="\"temperature\":\""+web_interface->answer4M105.substring(Tpos+3,slashpos)+"\",\"target\":\""+web_interface->answer4M105.substring(slashpos+2,spacepos)+"\",\"active\":\"1\"";
			}
		else{//no extruder temperature
			buffer2send+="\"temperature\":\"0\",\"target\":\"0\",\"active\":\"0\"";
			}
		}	
	else{//no extruder temperature
			buffer2send+="\"temperature\":\"0\",\"target\":\"0\",\"active\":\"0\"";
			}
	buffer2send+="},";
	
	//Bed
	buffer2send+="{\"name\":\"Bed\",";
	Tpos = web_interface->answer4M105.indexOf("B:");
	if (Tpos>-1)
		{
		slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
		spacepos = web_interface->answer4M105.indexOf(" ",slashpos+2);
		if(slashpos!=-1 && spacepos!=-1 )
			{
			temperature = (int)atof(web_interface->answer4M105.substring(Tpos+2,slashpos).c_str());
			target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
			buffer2send+="\"temperature\":\""+web_interface->answer4M105.substring(Tpos+2,slashpos)+"\",\"target\":\""+web_interface->answer4M105.substring(slashpos+2,spacepos)+"\",\"active\":\"1\"";
			}
		else{//no extruder temperature
			buffer2send+="\"temperature\":\"0\",\"target\":\"0\",\"active\":\"0\"";
			}
		}	
	else{//no extruder temperature
			buffer2send+="\"temperature\":\"0\",\"target\":\"0\",\"active\":\"0\"";
			}
	buffer2send+="}";
	buffer2send+="],";
	
