luc-github/ESP3D/esp8266/webinterface.cpp
	//information
	buffer2send+="\"InformationMsg\":[";
	for (int i=0;i<web_interface->info_msg.size();i++)
	{
		if (i>0)buffer2send+=",";
		buffer2send+="{\"line\":\"";
		buffer2send+=web_interface->info_msg.get(i);
		buffer2send+="\"}";
	}
	buffer2send+="],";
	//Error
	buffer2send+="\"ErrorMsg\":[";
	for (int i=0;i<web_interface->error_msg.size();i++)
	{
		if (i>0)buffer2send+=",";
		buffer2send+="{\"line\":\"";
		buffer2send+=web_interface->error_msg.get(i);
		buffer2send+="\"}";
	}
	buffer2send+="],";
	//Status
	buffer2send+="\"StatusMsg\":[";
	for (int i=0;i<web_interface->status_msg.size();i++)
	{
		if (i>0)buffer2send+=",";
		buffer2send+="{\"line\":\"";
		buffer2send+=web_interface->status_msg.get(i);
		buffer2send+="\"}";
	}
	buffer2send+="]";
	buffer2send+="}";
	web_interface->WebServer.send(200, "application/json",buffer2send);	
}

String formatBytes(size_t bytes){
  if (bytes < 1024){
    return String(bytes)+"oct";
  } else if(bytes < (1024 * 1024)){
    return String(bytes/1024.0)+"Ko";
  } else if(bytes < (1024 * 1024 * 1024)){
    return String(bytes/1024.0/1024.0)+"Mo";
  } else {
    return String(bytes/1024.0/1024.0/1024.0)+"Go";
  }
}

String getContentType(String filename){
   if(filename.endsWith(".htm")) return "text/html";
  else if(filename.endsWith(".html")) return "text/html";
  else if(filename.endsWith(".css")) return "text/css";
  else if(filename.endsWith(".js")) return "application/javascript";
  else if(filename.endsWith(".png")) return "image/png";
  else if(filename.endsWith(".gif")) return "image/gif";
  else if(filename.endsWith(".jpg")) return "image/jpeg";
  else if(filename.endsWith(".ico")) return "image/x-icon";
  else if(filename.endsWith(".xml")) return "text/xml";
  else if(filename.endsWith(".pdf")) return "application/x-pdf";
  else if(filename.endsWith(".zip")) return "application/x-zip";
  else if(filename.endsWith(".gz")) return "application/x-gzip";
  else if(filename.endsWith(".tpl")) return "text/plain";
  else if(filename.endsWith(".inc")) return "text/plain";
  else if(filename.endsWith(".txt")) return "text/plain";
  return "application/octet-stream";
}
void handleFileUpload(){
   if(web_interface->WebServer.uri() != "/FILES") return;
  HTTPUpload& upload = (web_interface->WebServer).upload();
  if(upload.status == UPLOAD_FILE_START){
    String filename = upload.filename;
    web_interface->fsUploadFile = SPIFFS.open(filename, "w");
    filename = String();
  } else if(upload.status == UPLOAD_FILE_WRITE){
    if(web_interface->fsUploadFile)
		{
		web_interface->fsUploadFile.write(upload.buf, upload.currentSize);
		}
  } else if(upload.status == UPLOAD_FILE_END){
    if(web_interface->fsUploadFile)
      web_interface->fsUploadFile.close();
  }
  else Serial.println("Cannot open file");
}

void handleFileList() {
	String path = "/";
	String status="Ok";
	if(web_interface->WebServer.hasArg("action")) {
		if(web_interface->WebServer.arg("action")=="delete" && web_interface->WebServer.hasArg("filename"))
			{
				String filename;
				 web_interface->urldecode(filename,web_interface->WebServer.arg("filename").c_str());
				if(!SPIFFS.exists(filename)){
					 status="Cannot delete, file not found!";
					}
				else
					{
						SPIFFS.remove(filename);
					}
			}
	  }
	String jsonfile = "{\"path\":\"" + path + "\",";
	Dir dir = SPIFFS.openDir(path);
	jsonfile+="\"files\":[";
	bool firstentry=true;
	while (dir.next()) {
		if (!firstentry) jsonfile+=",";
		else firstentry=false;
		jsonfile+="{";
		jsonfile+="\"name\":\"";
		jsonfile+=dir.fileName();
		jsonfile+="\",\"size\":\"";
		File f = dir.openFile("r");
		jsonfile+=formatBytes(f.size());
		jsonfile+="\"";
		jsonfile+="}";
		f.close();
		}	
	jsonfile+="],";
	jsonfile+="\"status\":\"" + status + "\",";
	uint32_t total;
	uint32_t  used;
	SPIFFS.info(&total,&used);
	jsonfile+="\"total\":\"" + formatBytes(total) + "\",";
	jsonfile+="\"used\":\"" + formatBytes(used) + "\",";
	jsonfile+="\"occupation\":\"" ;
	jsonfile+= intTostr(100*used/total);
	jsonfile+="\"";
	jsonfile+="}";
	path = "";
	web_interface->WebServer.send(200, "application/json", jsonfile);
}

void handleSDFileList() {
	String jsonfile = "[";
	for (int i=0;i<web_interface->fileslist.size();i++)
	{
		if (i>0)jsonfile+=",";
		jsonfile+="{\"entry\":\"";
		jsonfile+=web_interface->fileslist.get(i);
		jsonfile+="\"}";
	}
	jsonfile+="]";
	web_interface->WebServer.send(200, "application/json", jsonfile);
}


//do a redirect to avoid to many query
//and handle not registred path
void handle_not_found()
{
  String path = web_interface->WebServer.uri();
  String contentType = getContentType(path);
  String pathWithGz = path + ".gz";
  if(SPIFFS.exists(pathWithGz) || SPIFFS.exists(path))
	{
		if(SPIFFS.exists(pathWithGz)) path += ".gz";
		File file = SPIFFS.open(path, "r");
		web_interface->WebServer.streamFile(file, contentType);
		file.close();
	}
else 
	{
		if (SPIFFS.exists("/404.tpl"))
			{
			STORESTRINGS_CLASS KeysList ;
			STORESTRINGS_CLASS ValuesList ;
			String stmp;
			KeysList.add(FPSTR(KEY_FREE_MEM));
			ValuesList.add(intTostr(system_get_free_heap_size()));
			//IP
			stmp=FPSTR(KEY_IP);
			KeysList.add(stmp);
			if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
			else stmp=WiFi.softAPIP().toString();
			ValuesList.add(stmp);
			//Web address = ip + port
			KeysList.add(FPSTR(KEY_WEB_ADDRESS));
			if (wifi_config.iweb_port!=80)
				{
				stmp+=":";
				stmp+=intTostr(wifi_config.iweb_port);
				}
			ValuesList.add(stmp);
			//mode
			if (wifi_get_opmode()==WIFI_STA )
				{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_STA));
				}
			else
				{
				if (wifi_get_opmode()==WIFI_AP )
					{
						KeysList.add(FPSTR(KEY_MODE));
						ValuesList.add(FPSTR(VALUE_AP));
					}
				else
					{
						KeysList.add(FPSTR(KEY_MODE));
						ValuesList.add(FPSTR(VALUE_AP_STA));
					}
				}
			//page title
			KeysList.add(FPSTR(KEY_PAGE_TITLE));
			ValuesList.add("404 Page not found");
			//tpl file name with extension
			KeysList.add(FPSTR(KEY_FILE_NAME));
			ValuesList.add("404.tpl");
			//tpl file name without extension
			KeysList.add(FPSTR(KEY_SHORT_FILE_NAME));
			ValuesList.add("404");
			//process the template file and provide list of variables
			if(KeysList.size()==ValuesList.size())	//Sanity check
				processTemplate("/404.tpl", KeysList , ValuesList);
			//need to clean to speed up memory recovery
			KeysList.clear();
			ValuesList.clear();
			}
		else
		{ //if not template use default page
			contentType=FPSTR(PAGE_404);
			String stmp;
			if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
			else stmp=WiFi.softAPIP().toString();
			//Web address = ip + port
			String KEY_IP = FPSTR(KEY_WEB_ADDRESS);
			if (wifi_config.iweb_port!=80)
				{
				stmp+=":";
				stmp+=intTostr(wifi_config.iweb_port);
				}
			contentType.replace(KEY_IP,stmp);
			web_interface->WebServer.send(200,"text/html",contentType);
		}
	}
}

