luc-github/ESP3D/esp8266/webinterface.cpp
void handle_restart()
{
	if (SPIFFS.exists("/restart.tpl"))
		{
		STORESTRINGS_CLASS KeysList ;
		STORESTRINGS_CLASS ValuesList ;
		String stmp;
		KeysList.add(FPSTR(KEY_FREE_MEM));
		ValuesList.add(intTostr(system_get_free_heap_size()));
		//IP
		stmp=FPSTR(KEY_IP);
		KeysList.add(stmp);
		if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
		else stmp=WiFi.softAPIP().toString();
		ValuesList.add(stmp);
		//Web address = ip + port
		KeysList.add(FPSTR(KEY_WEB_ADDRESS));
		if (wifi_config.iweb_port!=80)
			{
			stmp+=":";
			stmp+=intTostr(wifi_config.iweb_port);
			}
		ValuesList.add(stmp);
		//mode
		if (wifi_get_opmode()==WIFI_STA )
			{
			KeysList.add(FPSTR(KEY_MODE));
			ValuesList.add(FPSTR(VALUE_STA));
			}
		else
			{
			if (wifi_get_opmode()==WIFI_AP )
				{
					KeysList.add(FPSTR(KEY_MODE));
					ValuesList.add(FPSTR(VALUE_AP));
				}
			else
				{
					KeysList.add(FPSTR(KEY_MODE));
					ValuesList.add(FPSTR(VALUE_AP_STA));
				}
			}
		//page title
		KeysList.add(FPSTR(KEY_PAGE_TITLE));
		ValuesList.add("Restarting...");
		//tpl file name with extension
		KeysList.add(FPSTR(KEY_FILE_NAME));
		ValuesList.add("restart.tpl");
		//tpl file name without extension
		KeysList.add(FPSTR(KEY_SHORT_FILE_NAME));
		ValuesList.add("restart");
		//process the template file and provide list of variables
		if(KeysList.size()==ValuesList.size())	//Sanity check
			processTemplate("/restart.tpl", KeysList , ValuesList);
		//need to clean to speed up memory recovery
		KeysList.clear();
		ValuesList.clear();
		}
	else
		{//if not restart template use default
			String contentType=FPSTR(PAGE_RESTART);
			web_interface->WebServer.send(200,"text/html",contentType);
		}
	web_interface->restartmodule=true;
}

void handle_web_command()
{
	//check we have proper parameter
if (web_interface->WebServer.hasArg("COM"))
  {  
	  String scmd;
	  //decode command
	  web_interface->urldecode(scmd,web_interface->WebServer.arg("COM").c_str()); 
	  scmd.trim();
	  //send command to serial
	  Serial.println(scmd);
	  //give an ack - we need to be polite, right ?
	  web_interface->WebServer.send(200,"text/plain","Ok");
  }
}


 #ifdef SSDP_FEATURE
 void handle_SSDP(){
      SSDP.schema(web_interface->WebServer.client());
    }
 #endif

//URI Decoding function 
void   WEBINTERFACE_CLASS::urldecode( String & dst, const char *src)
{
  char a, b,c;
  dst="";
  while (*src) {
    if ((*src == '%') &&
      ((a = src[1]) && (b = src[2])) &&
      (isxdigit(a) && isxdigit(b))) {
      if (a >= 'a')
        a -= 'a'-'A';
      if (a >= 'A')
        a -= ('A' - 10);
      else
        a -= '0';
      if (b >= 'a')
        b -= 'a'-'A';
      if (b >= 'A')
        b -= ('A' - 10);
      else
        b -= '0';
      dst+= char(16*a+b);
      src+=3;
    } 
    else {
		c = *src++;
		if(c=='+')c=' ';
      dst+= char(c);
    }
  }
}


//constructor
WEBINTERFACE_CLASS::WEBINTERFACE_CLASS (int port):WebServer(port)
{
	//init what will handle "/"
	WebServer.on("/",HTTP_ANY, handle_web_interface_root);
	WebServer.on("/CONFIGSYS",HTTP_ANY, handle_web_interface_configSys);
	WebServer.on("/CONFIGAP",HTTP_ANY, handle_web_interface_configAP);
	WebServer.on("/CONFIGSTA",HTTP_ANY, handle_web_interface_configSTA);
	WebServer.on("/STATUS",HTTP_ANY, handle_web_interface_status);
	WebServer.on("/SETTINGS",HTTP_ANY, handle_web_settings);
	WebServer.on("/PRINTER",HTTP_ANY, handle_web_interface_printer);
	WebServer.on("/CMD",HTTP_ANY, handle_web_command);
	WebServer.on("/RESTART",HTTP_GET, handle_restart);
	WebServer.on("/FILES", HTTP_ANY, handleFileList);
	WebServer.on("/SDFILES", HTTP_ANY, handleSDFileList);
	WebServer.onFileUpload(handleFileUpload);
	//Captive portal Feature
	#ifdef CAPTIVE_PORTAL_FEATURE
	WebServer.on("/generate_204",HTTP_ANY, handle_web_interface_root);
	WebServer.on("/fwlink",HTTP_ANY, handle_web_interface_root);
	#endif
	#ifdef SSDP_FEATURE
	WebServer.on("/description.xml", HTTP_GET, handle_SSDP);
	#endif
	WebServer.onNotFound( handle_not_found);
	answer4M105="T:0 /0 ";
	answer4M114="X:0.0 Y:0.0 Z:0.000";
	answer4M220="100";
	answer4M221="100";
	last_temp=system_get_time();
	restartmodule=false;
	//rolling list of 4entries with a maximum of 50 char for each entry
	error_msg.setsize(4);
	error_msg.setlenght(50);
	info_msg.setsize(4);
	info_msg.setlenght(50);
	status_msg.setsize(4);
	status_msg.setlenght(50);
	fileslist.setlenght(30);//12 for filename + space + size
	fileslist.setsize(70); // 70 files to limite to 2K
	fsUploadFile=(fs::File)0;
}
//Destructor
WEBINTERFACE_CLASS::~WEBINTERFACE_CLASS()
{
	info_msg.clear();
	error_msg.clear();
	status_msg.clear();
	fileslist.clear();
}

WEBINTERFACE_CLASS * web_interface;

